package kr.ac.kopo.day03.exam;

/*
 	1>
 		12345
 		23456
 		34567
 		45678
 		56789
 		
 	2>
 		56789
 		45678
 		34567
 		23456
 		12345
 		
 	3>
 		*****
 		****
 		***
 		**
 		*
 	
 	4>
 		*
 		**
 		***
 		****
 		*****
 		****
 		***
 		**
 		*
 		
 		for3 + if1
 		for2 + if1
 		
 		for(int i = 1; i <= 9; i++) {
 		}
 	
 	5>
 		*****
 		-****
 		--***
 		---**
 		----*
 		---**
 		--***
 		-****
 		*****
 		
 		System.out.print(' ');
 		
 		for5 + if1
 		for3 + if2
 		for3 + if1
 		for2 + if2
 		
 	6>
 		*********
 		 *******
 		  *****
 		   ***
 		    *
 		    
 	7>
 			*
 		   ***
   		  *****
 		 *******
 		*********
 		 *******
    	  *****
 		   ***
 		    *
 		   
 	8>
 		*-------*
 		**-----**
 		***---***
 		****-****
 		*********
 		****-****
 		***---***
 		**-----**
 		*-------*
 		    
 		  3 - 20사이의 라인수를 입력하세요 : 5
 		  
 		  *
 		  **
 		  ***
 		  **
 		  *
 		    
 		  3 - 20사이의 라인수를 입력하세요 : 11
 		  
		 *
		 **
		 ***
		 ****
		 *****
		 ******
		 *****
		 ****
		 ***
		 **
		 *
 */

public class ExamMain01 {

	public static void main(String[] args) {

		// 4번문제 풀이
		// 방법1
		
		for(int i = 1; i <= 9; i++) {
			if(i <= 5) {
				for(int j = 1; j <= i; j++) {
					System.out.print('*');
				}
			} else {
				for(int j = 1; j <= 10-i; j++) {
					System.out.print('*');
				}
			}
			System.out.println();
		}
	}
}




















